app/views/carts/_cart.html.erb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 3]]
---
<table>
    <% @cart.lineitems.each do |item| %>