app/controllers/carts_controller.rb

DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
---
  def destroy
    session[:cart_id] = nil #购物车将被消除不被再使用
    @cart.destroy