app/controllers/lineitems_controller.rb

  def create

    product = Product.find(params[:product_id])

    #去cart model里添加add_item function
    @lineitem = @cart.add_item(product.id)

    respond_to do |format|
      if @lineitem.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2021-12-08 06:58:25.573588"], ["updated_at", "2021-12-08 06:58:25.573588"]]
INSERT INTO "lineitems" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 11], ["cart_id", 6], ["created_at", "2021-12-09 20:34:49.667172"], ["updated_at", "2021-12-09 20:34:49.667172"]]
UPDATE "lineitems" SET "updated_at" = ?, "quantity" = ? WHERE "lineitems"."id" = ?  [["updated_at", "2021-12-10 00:47:53.583797"], ["quantity", 2], ["id", 1]]