app/controllers/orders_controller.rb

SELECT "lineitems".* FROM "lineitems" WHERE "lineitems"."cart_id" = ?  [["cart_id", 3]]
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."cart_id" = ? LIMIT ?  [["cart_id", 6], ["LIMIT", 1]]
---
  def new
    if @cart.lineitems.empty?

INSERT INTO "orders" ("name", "address", "email", "paytype", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "11"], ["address", "11"], ["email", "11"], ["paytype", "venmo"], ["created_at", "2021-12-09 20:35:05.504089"], ["updated_at", "2021-12-09 20:35:05.504089"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 6]]
---
  def create
    @order = Order.new(order_params)

    @order.add_items_from_cart(@cart)

    respond_to do |format|
      if @order.save

        Cart.destroy(session[:cart_id])