app/controllers/search_controller.rb

SELECT "products".* FROM "products" WHERE "products"."name" = ? LIMIT ?  [["name", "Frozen"], ["LIMIT", 1]]
---
  def new
    @product = Product.find_by(name: params[:search])