app/models/product.rb

    def make_sure_no_line_items
        if self.lineitems.empty?
---
SELECT 1 AS one FROM "lineitems" WHERE "lineitems"."product_id" = ? LIMIT ?  [["product_id", 13], ["LIMIT", 1]]